let muse = ['高坂穂乃果', '南ことり', '園田海未', '星空凛', '小泉花陽', '西木野真姫', '矢澤にこ', '東條希', '絢瀬絵里']
let aqours = ['高海千歌', '桜内梨子', '渡辺曜', '国木田花丸', '津島善子', '黒澤ルビィ', '黒澤ダイヤ', '小原鞠莉', '松浦果南']
let niji = ['上原歩夢', '宮下愛', '優木せつ菜(中川菜々)', '天王寺璃奈', '桜坂しずく', '中須かすみ', '近江彼方', '朝香果林', 'エマ･ヴェルデ']

while(1){
    let stc = prompt('数字を入力してください。負の値の場合終了します。')
    let item = parseInt(stc)

    if(item < 0){
        break
    }

    let num

    if(item <= 9){
        num = 9%item
    }
    else{
        num = item%9
    }

    alert('相性のいいアイドルは'+muse[num]+","+aqours[num]+","+niji[num]+'です。')
}